function [X,Y]=Flake()
Lmax = 4;
% Функція, що повертає зображення сніжинки Коха
% Lmax — порядок сніжинки
% породжуючі правила
Axiom='F+F+F'; Newf='F-F+F'; teta=pi*(2/3); 
alpha=0; p=[0;0]; % стартова точка
p=CoordSnow(p,Lmax,Axiom,Newf,alpha,teta);
% звертання до функції, що повертає координати вершин
M=size(p,2); % число вершин 
X=p(1:1,1:M); % створення вектора, що містить Х-ті координати вершин сніжинки
Y=p(2:2,1:M); % створення вектора, що містить Y-ті координати вершин сніжинки
figure; plot(X,Y,'Color','r'); % побудова сніжинки Коха
end