function z=MD(Lx,Ly,N,Ni,dt,RV) % Функція, що повертає складний масив z, який містить 
% значення координат, проекцій швидкостей та прискорень частинок на відповідні 
% координатні осі у вузлах часової сітки
% Lx - ширина МД-комірки, Ly - висота МД-комірки
% N - число частинок системи
% Ni - число МД-кроків, dt - крок інтегрування рівнянь руху
% А - масив, який повертає функція init
Accold=Acc(RV,Lx,Ly,N); A2=cat(2,RV,Accold); A3=cat(3,A2); k=0;
while k<Ni
    A2=Verlet(A2,Lx,Ly,N,dt); A3=cat(3,A3,A2); k=k+1;
end
z=A3;
end
