% спочатку задаємо константи
e=1.6*10^-19; % заряд електрону
R0=10^-6; % одиниця вимірювання відстані
N=23; % число зарядів
i=1:N;
q(i)=e.*((-1).^(i));% заповнення вектору, що містить значення зарядів
x1=-5*R0; % х-ва координата лівого кінця системи зарядів
x2=5*R0; % х-ва координата правого кінця системи зарядів
xq(i)=x1+(x2-x1)/N*i; % обчислення х-х координат системи зарядів
yq(i)=0; % задання у-х координат системи зарядів
N1=133; % число вузлів прямокутної координатної сітки
Xmin=-10*R0; Ymin=-10*R0; % задання координат нижнього лівого кута сітки
Xmax=10*R0; Ymax=10*R0; % задання координат верхнього правого кута сітки
i=1:N1+1; 
X(i)=Xmin+(Xmax-Xmin)/N1*(i+1); % обчислення х-х координат вузлів сітки
j=1:N1+1; 
Y(j)=Ymin+(Ymax-Ymin)/N1*(j+1); % обчислення у-х координат вузлів сітки
M(i,j)=potential(q,xq,yq,X,Y); % обчислення значень потенціалу у вузлах сітки
[X1,Y1]=meshgrid(X,Y);

% візуалізація поверхні fi
figure(1); 
surf(X1,Y1,M); 
colormap jet; 
title('Зображення поверхні fi(x,y) (з сіткою)');
xlabel('\itx'); 
ylabel("\ity");
zlabel("\itPotential M");

figure(2); 
surf(X1,Y1,M); 
shading interp;
title('Зображення поверхні fi(x,y) (без сітки та заповнення поверхні функції)');
xlabel('\itx'); 
ylabel("\ity");
zlabel("\itPotential M");

figure(3);
contour(X1,Y1,M,133); % 133 – число ліній рівня
colormap jet;
title('Зображення двовимірної карти ліній рівня функції fi(x,y)');
xlabel('\itx'); 
ylabel("\ity");
zlabel("\itPotential M");

figure(4); 
[C,h] = contour(X1,Y1,M); 
clabel(C,h); 
colormap jet;
title('Зображення кожного еквіпотенціала функції fi(x,y)');
xlabel('\itx'); 
ylabel("\ity");
zlabel("\itPotential M");

figure(5); 
contour3(X1,Y1,M,133);
title('Зображення трьохвимірної карти ліній рівня функції fi(x,y)');
xlabel('\itx'); 
ylabel("\ity");
zlabel("\itPotential M");